<?php

return array (
  'accepted' => 'គុណលក្ខណៈ៖ ត្រូវតែទទួលយក',
  'accepted_if' => 'គុណលក្ខណៈ៖ ត្រូវតែទទួលយកនៅពេល៖ ផ្សេងទៀតគឺ៖ គុណតម្លៃ',
  'active_url' => 'គុណលក្ខណៈ៖ មិនមែនជា URL ត្រឹមត្រូវទេ',
  'after' => 'គុណលក្ខណៈ៖ ត្រូវតែជាកាលបរិច្ឆេទបន្ទាប់ពី៖ កាលបរិច្ឆេទ',
  'after_or_equal' => 'គុណលក្ខណៈ៖ ត្រូវតែជាកាលបរិច្ឆេទបន្ទាប់ពីឬស្មើនឹង៖ កាលបរិច្ឆេទ',
  'alpha' => 'គុណលក្ខណៈ៖ ត្រូវតែមានអក្សរប៉ុណ្ណោះ',
  'alpha_dash' => 'គុណលក្ខណៈ៖ ត្រូវតែមានអក្សរលេខសញ្ញាដកនិងសញ្ញាគូសក្រោម',
  'alpha_num' => 'គុណលក្ខណៈ៖ ត្រូវតែមានអក្សរនិងលេខប៉ុណ្ណោះ',
  'array' => 'គុណលក្ខណៈ៖ ត្រូវតែជាអារេ',
  'attributes' => 
  array (
  ),
  'before' => 'គុណលក្ខណៈ៖ ត្រូវតែជាកាលបរិច្ឆេទមុនកាលបរិច្ឆេទ៖ កាលបរិច្ឆេទ',
  'before_or_equal' => 'គុណលក្ខណៈ៖ ត្រូវតែជាកាលបរិច្ឆេទមុនឬស្មើនឹង៖ កាលបរិច្ឆេទ',
  'between' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមានរវាង៖ អប្បបរមានិង៖ ធាតុអតិបរមា',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែស្ថិតនៅចន្លោះ៖ អប្បបរមានិង៖ អតិបរមាគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែស្ថិតនៅចន្លោះ៖ អប្បបរមានិង៖ អតិបរមា',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែនៅចន្លោះ៖ អប្បបរមានិង៖ តួអក្សរអតិបរមា',
  ),
  'boolean' => 'Field៖ គុណលក្ខណៈត្រូវតែពិតឬមិនពិត',
  'confirmed' => 'ការបញ្ជាក់៖ គុណលក្ខណៈមិនត្រូវគ្នាទេ',
  'current_password' => 'ពាក្យសម្ងាត់មិនត្រឹមត្រូវ',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'សារផ្ទាល់ខ្លួន',
    ),
  ),
  'date' => 'គុណលក្ខណៈ៖ មិនមែនជាកាលបរិច្ឆេទត្រឹមត្រូវទេ',
  'date_equals' => 'គុណលក្ខណៈ៖ ត្រូវតែជាកាលបរិច្ឆេទស្មើនឹង៖ កាលបរិច្ឆេទ',
  'date_format' => 'គុណលក្ខណៈ៖ មិនត្រូវនឹងទំរង់៖ ទ្រង់ទ្រាយ',
  'different' => 'គុណលក្ខណៈនិង៖ ផ្សេងទៀតត្រូវតែខុសគ្នា',
  'digits' => 'គុណលក្ខណៈ៖ ត្រូវតែជា៖ ខ្ទង់ខ្ទង់',
  'digits_between' => 'គុណលក្ខណៈ៖ ត្រូវតែស្ថិតនៅចន្លោះ៖ អប្បបរមានិង៖ ខ្ទង់អតិបរមា',
  'dimensions' => 'គុណលក្ខណៈ៖ មានវិមាត្ររូបភាពមិនត្រឹមត្រូវ',
  'distinct' => 'គុណលក្ខណៈ៖ មានវិមាត្ររូបភាពមិនត្រឹមត្រូវ',
  'email' => 'គុណលក្ខណៈ៖ ត្រូវតែជាអាសយដ្ឋានអ៊ីមែលត្រឹមត្រូវ',
  'ends_with' => 'គុណលក្ខណៈ៖ ត្រូវតែបញ្ចប់ដោយមួយក្នុងចំណោមខាងក្រោមនេះ៖ តម្លៃ',
  'exists' => 'ដែលបានជ្រើសរើស៖ គុណលក្ខណៈមិនត្រឹមត្រូវ',
  'file' => 'គុណលក្ខណៈ៖ ត្រូវតែជាឯកសារ',
  'filled' => 'Field៖ គុណលក្ខណៈត្រូវតែមានតម្លៃ',
  'gt' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមានលើសពី៖ ធាតុតម្លៃ',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាង៖ តម្លៃគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាង៖ តម្លៃ។',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាង៖ តួអក្សរតម្លៃ',
  ),
  'gte' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមាន៖ ធាតុមានតម្លៃឬច្រើនជាងនេះ',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាងឬស្មើ៖ តម្លៃគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាងឬស្មើ៖ តម្លៃ',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែធំជាងឬស្មើ៖ តួអក្សរតម្លៃ',
  ),
  'image' => 'គុណលក្ខណៈ៖ ត្រូវតែជារូបភាព',
  'in' => 'ដែលបានជ្រើសរើស៖ គុណលក្ខណៈមិនត្រឹមត្រូវ',
  'in_array' => 'Field៖ គុណលក្ខណៈមិនមាននៅក្នុង៖ ផ្សេងទៀត',
  'integer' => 'គុណលក្ខណៈ៖ ត្រូវតែជាចំនួនគត់',
  'ip' => 'គុណលក្ខណៈ៖ ត្រូវតែជាអាសយដ្ឋាន IP ត្រឹមត្រូវ',
  'ipv4' => 'គុណលក្ខណៈ៖ ត្រូវតែជាអាសយដ្ឋាន IPv4 ត្រឹមត្រូវ',
  'ipv6' => 'គុណលក្ខណៈ៖ ត្រូវតែជាអាសយដ្ឋាន IPv6 ត្រឹមត្រូវ',
  'json' => 'គុណលក្ខណៈ៖ ត្រូវតែជាខ្សែអក្សរ JSON ត្រឹមត្រូវ',
  'lt' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមានតិចជាង៖ ធាតុតម្លៃ',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែតិចជាង៖ តម្លៃគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែតិចជាង៖ តម្លៃ',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែតូចជាង៖ តួអក្សរតម្លៃ',
  ),
  'lte' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ មិនត្រូវមានលើសពី៖ ធាតុតម្លៃទេ',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែតិចជាងឬស្មើ៖ តម្លៃគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែតូចជាងឬស្មើ៖ តម្លៃ',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែតូចជាងឬស្មើ៖ តួអក្សរតម្លៃ',
  ),
  'max' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ មិនត្រូវមានលើសពី៖ ធាតុអតិបរមាទេ',
    'file' => 'គុណលក្ខណៈ៖ មិនត្រូវធំជាង៖ អតិបរមាគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ មិនត្រូវធំជាង៖ អតិបរមាទេ',
    'string' => 'គុណលក្ខណៈ៖ មិនត្រូវធំជាង៖ តួអក្សរអតិបរមា',
  ),
  'mimes' => 'គុណលក្ខណៈ៖ ត្រូវតែជាឯកសារប្រភេទ៖ តម្លៃ',
  'mimetypes' => 'គុណលក្ខណៈ៖ ត្រូវតែជាឯកសារប្រភេទ៖ តម្លៃ',
  'min' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមានយ៉ាងហោចណាស់៖ ធាតុអប្បបរមា',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវមានយ៉ាងហោចណាស់៖ មីនគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវមានយ៉ាងហោចណាស់៖ អប្បបរមា',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែមានយ៉ាងហោចណាស់៖ តួអក្សរតូច',
  ),
  'multiple_of' => 'គុណលក្ខណៈ៖ ត្រូវតែជាពហុគុណនៃ៖ តម្លៃ',
  'not_in' => 'ដែលបានជ្រើសរើស៖ គុណលក្ខណៈមិនត្រឹមត្រូវ',
  'not_regex' => 'ទ្រង់ទ្រាយ៖ គុណលក្ខណៈមិនត្រឹមត្រូវ',
  'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែជាលេខ',
  'password' => 'ពាក្យសម្ងាត់មិនត្រឹមត្រូវ',
  'present' => 'គុណលក្ខណៈField៖ ត្រូវតែមាន។',
  'prohibited' => 'គុណលក្ខណៈField៖  ត្រូវបានហាមឃាត់',
  'prohibited_if' => 'គុណលក្ខណៈField៖ ត្រូវបានហាមឃាត់នៅពេល៖ ផ្សេងទៀតគឺ៖ តម្លៃ',
  'prohibited_unless' => 'គុណលក្ខណៈField៖ ត្រូវបានហាមឃាត់លុះត្រាតែ៖ ផ្សេងទៀតមាននៅក្នុង៖ គុណតម្លៃ',
  'regex' => 'ទ្រង់ទ្រាយ៖ គុណលក្ខណៈមិនត្រឹមត្រូវ',
  'required' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារ',
  'required_if' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារនៅពេល៖ ផ្សេងទៀតគឺ៖ តម្លៃ',
  'required_unless' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារលុះត្រាតែ៖ ផ្សេងទៀតមាននៅក្នុង៖ តម្លៃ',
  'required_with' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារនៅពេល៖ តម្លៃមានវត្តមាន',
  'required_with_all' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារនៅពេល៖ តម្លៃមានវត្តមាន',
  'required_without' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារនៅពេល៖ តម្លៃមិនមាន',
  'required_without_all' => 'គុណលក្ខណៈField៖ ត្រូវបានទាមទារនៅពេលគ្មានតម្លៃ',
  'same' => '៖ គុណលក្ខណៈនិង៖ ផ្សេងទៀតត្រូវតែត្រូវគ្នា',
  'size' => 
  array (
    'array' => 'គុណលក្ខណៈ៖ ត្រូវតែមាន៖ ធាតុទំហំ',
    'file' => 'គុណលក្ខណៈ៖ ត្រូវតែជា៖ ទំហំគីឡូបៃ',
    'numeric' => 'គុណលក្ខណៈ៖ ត្រូវតែជា៖ ទំហំ',
    'string' => 'គុណលក្ខណៈ៖ ត្រូវតែជា៖ តួអក្សរទំហំ',
  ),
  'starts_with' => 'គុណលក្ខណៈ៖ ត្រូវតែចាប់ផ្តើមដោយមួយក្នុងចំណោមខាងក្រោមនេះ៖ តម្លៃ',
  'string' => 'គុណលក្ខណៈ៖ ត្រូវតែជាខ្សែអក្សរ',
  'timezone' => 'គុណលក្ខណៈ៖ ត្រូវតែជាតំបន់ពេលវេលាត្រឹមត្រូវ',
  'unique' => 'គុណលក្ខណៈ៖ ត្រូវបានគេយករួចហើយ.',
  'uploaded' => 'គុណលក្ខណៈ៖ មិនអាចផ្ទុកឡើងបានទេ',
  'url' => 'គុណលក្ខណៈ៖ ត្រូវតែជា URL ត្រឹមត្រូវ',
  'uuid' => 'គុណលក្ខណៈ៖ ត្រូវតែជា UUID ដែលត្រឹមត្រូវ',
);
