<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Backpack\Base Language Lines
    |--------------------------------------------------------------------------
    */

    'registration_closed'    => 'ការចុះឈ្មោះត្រូវបានបិទ',
    'no_email_column'        => 'អ្នកប្រើប្រាស់មិនមានអាស័យដ្ឋានអ៊ីមែលដែលពាក់ព័ន្ធទេ',
    'first_page_you_see'     => 'ទំព័រដំបូងដែលអ្នកឃើញបន្ទាប់ពីចូល',
    'login_status'           => 'ស្ថានភាពចូល',
    'logged_in'              => 'អ្នកបានចូលហើយ!',
    'toggle_navigation'      => 'បិទបើកការរុករក',
    'administration'         => 'ការគ្រប់គ្រង',
    'user'                   => 'អ្នក​ប្រើ',
    'logout'                 => 'ចាកចេញ',
    'login'                  => 'ចូល',
    'register'               => 'ចុះឈ្មោះ',
    'name'                   => 'ឈ្មោះ',
    'email_address'          => 'អ៊ីមែល',
    'password'               => 'ពាក្យសម្ងាត់',
    'old_password'           => 'លេខសំងាត់​ចាស់',
    'new_password'           => 'ពាក្យសម្ងាត់​ថ្មី',
    'confirm_password'       => 'បញ្ជាក់ពាក្យសម្ងាត់',
    'remember_me'            => 'ចងចាំខ្ញុំ',
    'forgot_your_password'   => 'ភ្លេចលេខសំងាត់របស់អ្នក?',
    'reset_password'         => 'កំណត់ពាក្យសម្ងាត់ឡើងវិញ',
    'send_reset_link'        => 'ផ្ញើលីងលេខសំងាត់ឡើងវិញ',
    'click_here_to_reset'    => 'សូមចុចទីនេះដើម្បីកំណត់ពាក្យសម្ងាត់របស់អ្នកឡើងវិញ',
    'change_password'        => 'ផ្លាស់ប្តូរលេខសម្ងាត់',
    'unauthorized'           => 'គ្មានការអនុញ្ញាត',
    'dashboard'              => 'ផ្ទាំងគ្រប់គ្រង',
    'handcrafted_by'         => 'ធ្វើដោយដៃ',
    'powered_by'             => 'ឧបត្ថម្ភដោយ',
    'my_account'             => 'គណនី​របស់ខ្ញុំ',
    'update_account_info'    => 'ធ្វើព័ត៌មានគណនី',
    'save'                   => 'រក្សាទុក',
    'cancel'                 => 'បោះបង់',
    'error'                  => 'កំហុស',
    'success'                => 'ជោគជ័យ',
    'warning'                => 'ការព្រមាន',
    'notice'                 => 'សេចក្តីជូនដំណឹង',
    'old_password_incorrect' => 'ពាក្យសម្ងាត់ចាស់មិនត្រឹមត្រូវ។',
    'password_dont_match'    => 'ពាក្យសម្ងាត់មិនត្រូវគ្នា',
    'password_empty'         => 'សូមប្រាកដថា​​ fields ពាក្យសម្ងាត់ទាំងពីរត្រូវបានបំពេញ',
    'password_updated'       => 'បានពាក្យសម្ងាត់។',
    'account_updated'        => 'បានអាប់ដេតគណនីដោយជោគជ័យ។',
    'unknown_error'          => 'កំហុសដែលមិនស្គាល់បានកើតឡើង។ សូម​ព្យាយាម​ម្តង​ទៀត។',
    'error_saving'           => 'កំហុសក្នុងកំឡុងពេលរក្សាទុក។ សូម​ព្យាយាម​ម្តង​ទៀត។',
    'welcome'                => 'សូមស្វាគមន៍!',
    'use_sidebar'            => 'ប្រើសាយបារនៅចំហៀងខាងឆ្វេងដើម្បីធ្វើការកែសម្រួលឬលុបមាតិកា។',

    'password_reset' => [
        'greeting' => 'សួស្តី!',
        'subject'  => 'កំណត់ការជូនដំណឹងលេខសំងាត់ឡើងវិញ',
        'line_1'   => 'អ្នកកំពុងទទួលអ៊ីមែលនេះពីព្រោះយើងបានទទួលការស្នើសុំពាក្យសម្ងាត់ឡើងវិញសម្រាប់គណនីរបស់អ្នក។',
        'line_2'   => 'ចុចប៊ូតុងខាងក្រោមដើម្បីកំណត់ពាក្យសម្ងាត់របស់អ្នកឡើងវិញ៖',
        'button'   => 'កំណត់ពាក្យសម្ងាត់ឡើងវិញ',
        'notice'   => 'ប្រសិនបើអ្នកមិនបានស្នើសុំការកំណត់ពាក្យសម្ងាត់ឡើងវិញទេមិនត្រូវការសកម្មភាពបន្ថែមទេ។',
    ],

    'step'                 => 'ជំហាន',
    'confirm_email'        => 'បញ្ជាក់អ៊ីមែល',
    'choose_new_password'  => 'ជ្រើសរើសលេខសំងាត់ថ្មី',
    'confirm_new_password' => 'បញ្ជាក់​លេខសំងាត់​ថ្មី',

];
